[
    {
        "title": "Bybit Confirms Record-Breaking $1.46 Billion Crypto Heist in Sophisticated Cold Wallet Attack",
        "description": "Cryptocurrency exchange Bybit on Friday revealed that a \"sophisticated\" attack led to the theft of over $1.46 billion worth of cryptocurrency from one of its Ethereum cold (offline) wallets, making it the largest ever single crypto heist in history.  \"The incident occurred when our ETH multisig cold wallet executed  a transfer to our warm wallet. Unfortunately, this transaction was manipulated through a sophisticated attack that masked the signing interface, displaying the correct address while altering the underlying smart contract logic,\" Bybit said  in a post on X.  \"As a result, the attacker was able to gain control of the affected ETH cold wallet and transfer its holdings to an unidentified address.\"   In a separate statement posted on the social media platform, Bybit's CEO Ben Zhou emphasized  that all other cold wallets are secure. The company further said  it has reported the case to the appropriate authorities.  While there is no official con...",
        "url": "https://thehackernews.com/2025/02/bybit-confirms-record-breaking-146.html"
    },
    {
        "title": "OpenAI Bans Accounts Misusing ChatGPT for Surveillance and Influence Campaigns",
        "description": "OpenAI on Friday revealed  that it banned a set of accounts that used its ChatGPT tool to develop a suspected artificial intelligence (AI)-powered surveillance tool.  The social media listening tool is said to likely originate from China and is powered by one of Meta's Llama models , with the accounts in question using the AI company's models to generate detailed descriptions and analyze documents for an apparatus capable of collecting real-time data and reports about anti-China protests in the West and sharing the insights with Chinese authorities.  The campaign has been codenamed Peer Review owing to the \"network's behavior in promoting and reviewing surveillance tooling,\" researchers Ben Nimmo, Albert Zhang, Matthew Richard, and Nathaniel Hartley noted, adding the tool is designed to ingest and analyze posts and comments from platforms such as X, Facebook, YouTube, Instagram, Telegram, and Reddit.  In one instance flagged by the company, the actors used ChatG...",
        "url": "https://thehackernews.com/2025/02/openai-bans-accounts-misusing-chatgpt.html"
    },
    {
        "title": "Apple Drops iCloud's Advanced Data Protection in the U.K. Amid Encryption Backdoor Demands",
        "description": "Apple is removing its Advanced Data Protection (ADP) feature for iCloud from the United Kingdom with immediate effect following government demands for backdoor access to encrypted user data.  The development was first reported  by Bloomberg.  ADP for iCloud is an optional setting  that ensures that users' trusted devices retain sole access to the encryption keys used to unlock data stored in its cloud. This includes iCloud Backup, Photos, Notes, Reminders, Safari Bookmarks, voice memos, and data associated with its own apps.   \"We are gravely disappointed that the protections provided by ADP will not be available to our customers in the UK given the continuing rise of data breaches and other threats to customer privacy,\" the company was quoted as saying to Bloomberg.  \"ADP protects iCloud data with end-to-end encryption, which means the data can only be decrypted by the user who owns it, and only on their trusted devices.\"  Customers who are already using ADP ...",
        "url": "https://thehackernews.com/2025/02/apple-drops-iclouds-advanced-data.html"
    },
    {
        "title": "Data Leak Exposes TopSec's Role in China's Censorship-as-a-Service Operations",
        "description": "An analysis of a data leak from a Chinese cybersecurity company TopSec has revealed that it likely offers censorship-as-a-service solutions to prospective customers, including a state-owned enterprise in the country.  Founded in 1995, TopSec ostensibly offers services such as Endpoint Detection and Response (EDR) and vulnerability scanning. But it's also providing \"boutique\" solutions in order to align with government initiatives and intelligence requirements, SentinelOne researchers Alex Delamotte and Aleksandar Milenkoski said  in a report shared with The Hacker News.  The data leak contains infrastructure details and work logs from employees, as well as references to web content monitoring services used to enforce censorship for public and private sector customers.  It's believed that the company provided bespoke monitoring services to a state-owned enterprise hit by a corruption scandal, indicating that such platforms are being used to monitor and control public...",
        "url": "https://thehackernews.com/2025/02/data-leak-exposes-topsecs-role-in.html"
    },
    {
        "title": "Cybercriminals Can Now Clone Any Brand's Site in Minutes Using Darcula PhaaS v3",
        "description": "The threat actors behind the Darcula phishing-as-a-service (PhaaS) platform appear to be readying a new version that allows prospective customers and cyber crooks to clone any brand's legitimate website and create a phishing version, further bringing down the technical expertise required to pull off phishing attacks at scale.  The latest iteration of the phishing suite \"represents a significant shift in criminal capabilities, reducing the barrier to entry for bad actors to target any brand with complex, customizable phishing campaigns,\" Netcraft said  in a new analysis.   The cybersecurity company said it has detected and blocked more than 95,000 new Darcula phishing domains, nearly 31,000 IP addresses, and taken down more than 20,000 fraudulent websites since it was first exposed  in late March 2024.  The biggest change incorporated into Darcula is the ability for any user to generate a phishing kit for any brand in an on-demand fashion.  \"The new and remastered v...",
        "url": "https://thehackernews.com/2025/02/cybercriminals-can-now-clone-any-brands.html"
    },
    {
        "title": "Webinar: Learn How to Identify High-Risk Identity Gaps and Slash Security Debt in 2025",
        "description": "In today's rapidly evolving digital landscape, weak identity security isn't just a flaw—it's a major risk that can expose your business to breaches and costly downtime.  Many organizations are overwhelmed by an excess of user identities and aging systems, making them vulnerable to attacks. Without a strategic plan, these security gaps can quickly turn into expensive liabilities.  Join us for \" Building Resilient Identity: Reducing Security Debt in 2025 \"  and discover smart, actionable strategies to protect your business against modern cyber threats.  This webinar offers you a chance to cut through the complexity of identity security with clear, practical solutions. Our seasoned experts will show you how to detect risks early, optimize your resources, and upgrade your systems to stay ahead of emerging threats.  What You'll Learn:   Spot Hidden Risks:  Uncover how weaknesses in identity security can lead to significant breaches and extra costs.  Step-by-Step Solutions:  Follo...",
        "url": "https://thehackernews.com/2025/02/webinar-learn-how-to-identify-high-risk.html"
    },
    {
        "title": "AI and Security - A New Puzzle to Figure Out",
        "description": "AI is everywhere now, transforming how businesses operate and how users engage with apps, devices, and services. A lot of applications now have some Artificial Intelligence inside, whether supporting a chat interface, intelligently analyzing data or matching user preferences. No question AI benefits users, but it also brings new security challenges, especially Identity-related security challenges. Let's explore what these challenges are and what you can do to face them with Okta. Which AI? Everyone talks about AI, but this term is very general, and several technologies fall under this umbrella. For example, symbolic AI uses technologies such as logic programming, expert systems, and semantic networks. Other approaches use neural networks, Bayesian networks, and other tools. Newer Generative AI uses Machine Learning (ML) and Large Language Models (LLM) as core technologies to generate content such as text, images, video, audio, etc. Many of the applications we use most often toda...",
        "url": "https://thehackernews.com/2025/02/ai-and-security-new-puzzle-to-figure-out.html"
    },
    {
        "title": "AI-Powered Deception is a Menace to Our Societies",
        "description": "Wherever there's been conflict in the world, propaganda has never been far away. Travel back in time to 515 BC and read the Behistun Inscription, an autobiography by Persian King Darius that discusses his rise to power. More recently, see how different newspapers report on wars, where it's said, 'The first casualty is the truth.'   While these forms of communication could shape people's beliefs, they also carry limitations around scalability. Any messaging and propaganda would often lose its power after traveling a certain distance. Of course, with social media and the online world there are few physical limits on reach, apart from where someone's internet connection drops. Add in the rise of AI, and there's also nothing to stop the scalability either.   This article explores what this means for societies and organizations facing  AI-powered information manipulation  and deception.  The rise of the echo chamber  According to the Pew R...",
        "url": "https://thehackernews.com/2025/02/ai-powered-deception-is-menace-to-our.html"
    },
    {
        "title": "Cisco Confirms Salt Typhoon Exploited CVE-2018-0171 to Target U.S. Telecom Networks",
        "description": "Cisco has confirmed that a Chinese threat actor known as Salt Typhoon gained access by likely abusing a known security flaw tracked as CVE-2018-0171 , and by obtaining legitimate victim login credentials as part of a targeted campaign aimed at major U.S. telecommunications companies.  \"The threat actor then demonstrated their ability to persist in target environments across equipment from multiple vendors for extended periods, maintaining access in one instance for over three years,\" Cisco Talos said , describing the hackers as highly sophisticated and well-funded.   \"The long timeline of this campaign suggests a high degree of coordination, planning, and patience — standard hallmarks of advanced persistent threat (APT) and state-sponsored actors.\"  The networking equipment major said it found no evidence that other known security bugs have been weaponized by the hacking crew, contrary to a recent report from Recorded Future that revealed  exploitation attempts inv...",
        "url": "https://thehackernews.com/2025/02/cisco-confirms-salt-typhoon-exploited.html"
    },
    {
        "title": "CISA Flags Craft CMS Vulnerability CVE-2025-23209 Amid Active Attacks",
        "description": "A high-severity security flaw impacting the Craft content management system (CMS) has been added  by the U.S. Cybersecurity and Infrastructure Security Agency (CISA) to its Known Exploited Vulnerabilities ( KEV ) catalog, based on evidence of active exploitation.  The vulnerability in question is CVE-2025-23209  (CVSS score: 8.1), which impacts Craft CMS versions 4 and 5. It was addressed by the project maintainers in late December 2024 in versions 4.13.8 and 5.5.8.  \"Craft CMS contains a code injection vulnerability that allows for remote code execution as vulnerable versions have compromised user security keys,\" the agency said.   The vulnerability affects the following version of the software -   >= 5.0.0-RC1, < 5.5.5  >= 4.0.0-RC1, < 4.13.8   In an advisory released  on GitHub, Craft CMS noted that all unpatched versions of Craft with a compromised security key are impacted by the security defect.  \"If you can't update to a patched version, then rota...",
        "url": "https://thehackernews.com/2025/02/cisa-flags-craft-cms-vulnerability-cve.html"
    },
    {
        "title": "North Korean Hackers Target Freelance Developers in Job Scam to Deploy Malware",
        "description": "Freelance software developers are the target of an ongoing campaign that leverages job interview-themed lures to deliver cross-platform malware families known as BeaverTail and InvisibleFerret.  The activity, linked to North Korea, has been codenamed DeceptiveDevelopment, which overlaps with clusters tracked under the names Contagious Interview  (aka CL-STA-0240 ), DEV#POPPER, Famous Chollima, PurpleBravo, and Tenacious Pungsan. The campaign has been ongoing since at least late 2023.  \"DeceptiveDevelopment targets freelance software developers through spear-phishing on job-hunting and freelancing sites, aiming to steal cryptocurrency wallets and login information from browsers and password managers,\" cybersecurity company ESET said  in a report shared with The Hacker News.  In November 2024, ESET confirmed  to The Hacker News the overlaps between DeceptiveDevelopment and Contagious Interview, classifying it as a new Lazarus Group  activity that operates with an aim to conduc...",
        "url": "https://thehackernews.com/2025/02/north-korean-hackers-target-freelance.html"
    },
    {
        "title": "China-Linked Attackers Exploit Check Point Flaw to Deploy ShadowPad and Ransomware",
        "description": "A previously unknown threat activity cluster targeted European organizations, particularly those in the healthcare sector, to deploy PlugX and its successor, ShadowPad, with the intrusions ultimately leading to deployment of a ransomware called NailaoLocker in some cases.  The campaign, codenamed Green Nailao by Orange Cyberdefense CERT, involved the exploitation of a now-patched security flaw in Check Point network gateway security products ( CVE-2024-24919 , CVSS score: 7.5). The attacks were observed between June and October 2024.  \"The campaign relied on DLL search-order hijacking to deploy ShadowPad and PlugX – two implants often associated with China-nexus targeted intrusions,\" the company said  in a technical report shared with The Hacker News.   The initial access afforded by exploitation of vulnerable Check Point instances is said to have allowed the threat actors to retrieve user credentials and to connect to the VPN using a legitimate account.  In the next stage,...",
        "url": "https://thehackernews.com/2025/02/chinese-linked-attackers-exploit-check.html"
    }
]